app/views/users/index.html.erb

        <td><%= user.beers.size %></td>
        <td><%= user.ratings.size %></td>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" IN (1, 2, 3, 4, 5)