app/views/ratings/new.html.erb


    <%= f.select :beer_id, options_from_collection_for_select(@beers, :id, :to_s, selected: @rating.beer_id) %>
---
SELECT "beers".* FROM "beers"