app/controllers/breweries_controller.rb

  def index

  @breweries = Brewery.includes(:beers).all
---
SELECT "beers".* FROM "beers" WHERE "beers"."brewery_id" = ?  [["brewery_id", 4]]
SELECT "breweries".* FROM "breweries"

  def create
    expire_fragment('brewerylist')
    @brewery = Brewery.new(brewery_params)

    respond_to do |format|
      if @brewery.save
---
INSERT INTO "breweries" ("created_at", "name", "updated_at", "year") VALUES (?, ?, ?, ?)  [["created_at", Mon, 06 Jan 2014 17:48:10 UTC +00:00], ["name", "Koff"], ["updated_at", Mon, 06 Jan 2014 17:48:10 UTC +00:00], ["year", 1897]]

  def update

    expire_fragment('brewerylist')
    respond_to do |format|
      if @brewery.update(brewery_params)
---
UPDATE "breweries" SET "name" = ?, "updated_at" = ? WHERE "breweries"."id" = 4  [["name", "BrewDog"], ["updated_at", Thu, 16 Jan 2014 19:41:59 UTC +00:00]]

  def destroy

    expire_fragment('brewerylist')
    @brewery.destroy
---
DELETE FROM "breweries" WHERE "breweries"."id" = ?  [["id", 5]]