app/controllers/users_controller.rb

  def index
    @users = User.includes(:beers, :ratings)
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" IN (1, 4, 3)
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" IN (1, 2, 3, 4, 5)
SELECT "users".* FROM "users"

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Tue, 21 Jan 2014 22:37:36 UTC +00:00], ["updated_at", Tue, 21 Jan 2014 22:37:36 UTC +00:00], ["username", "mluukkai"]]

  def update
    respond_to do |format|
      if user_params[:username].nil? and @user == current_user and @user.update(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 5  [["password_digest", "$2a$10$pbXOWRjF9uhqZdZOZ3iGb.d20Wp9R9CKEHZ/fpuqcDhmUKSIh9oKq"], ["updated_at", Thu, 23 Jan 2014 18:29:26 UTC +00:00]]

  def destroy
    if @user == current_user
      @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]